---
kind: property
id: P:Autodesk.Revit.DB.Connector.GasketLength
zh: 连接件、接口
source: html/77dc3941-67b9-586e-8ad2-713c72ad981b.htm
---
# Autodesk.Revit.DB.Connector.GasketLength Property

**中文**: 连接件、接口

Connector gasket length. When applicable, it represents the distance from the end of the fabrication part to the center of the gasket. Otherwise it returns zero.

## Syntax (C#)
```csharp
public double GasketLength { get; }
```